Revit 2027 API
ControlShape Enumeration
An enumerated type listing four shapes of control that Autodesk Revit supports.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ControlShape
Public Enumeration ControlShape
public enum class ControlShape
type ControlShape
Members
Member name | Value | Description
DoubleHorizontalArrow | 3 | Double horizontal arrow.
DoubleVerticalArrow | 2 | Double vertical arrow.
HorizontalArrow | 1 | Horizontal arrow.
VerticalArrow | 0 | Vertical arrow.
See Also
Reference
Autodesk.Revit.DB Namespace